weather-api/app/controllers/searches_controller.rb

SELECT "searches".* FROM "searches"
---
    def index
        searches = Search.all
        if searches.length < 5
            @searches = searches.slice(0, searches.length)

INSERT INTO "searches" ("zip", "city", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["zip", "70001"], ["city", "Metairie"], ["created_at", "2020-06-18 15:00:41.685110"], ["updated_at", "2020-06-18 15:00:41.685110"]]
SELECT "searches".* FROM "searches"
---
    def create
        search = Search.new
        search.city = params[:city]
        search.zip = params[:zip]
        search.save

        @searches = Search.all
        if @searches.length < 5